app/controllers/items_controller.rb

  def show
    @item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" IN ('title', 'description')

  def create
    item_params = params.require(:item).permit(:title, :description, :owner, :category)
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("created_at", "description", "owner", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 19 Mar 2014 00:56:06 UTC +00:00], ["description", "this is something"], ["owner", "Me"], ["title", "something"], ["updated_at", Wed, 19 Mar 2014 00:56:06 UTC +00:00]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "type" = ?, "updated_at" = ? WHERE "items"."id" = 6  [["type", "dsfsd"], ["updated_at", Fri, 14 Mar 2014 00:10:42 UTC +00:00]]

  def search
    @categories = Category.all.map {|c| [c.title, c.id]}
---
SELECT "categories".* FROM "categories"

  def do_search
    @items = Item.where(title: params[:title], category_id: params[:category_id])
---
SELECT "items".* FROM "items" WHERE "items"."title" = 'shining bright' AND "items"."category_id" = 109