app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 12 Mar 2014 00:47:07 UTC +00:00], ["text", "this is the first post"], ["title", "first post"], ["updated_at", Wed, 12 Mar 2014 00:47:07 UTC +00:00]]
---
	def create
	  @post = Post.new(post_params)

	  @post.save